---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.GetKeys
source: html/6a561ea3-3b7e-7378-2987-cd0245758277.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.GetKeys Method

Gets all the keys stored in the map.

## Syntax (C#)
```csharp
public IList<ExportLineweightKey> GetKeys()
```

## Returns
The keys.